IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_adc_safecheck_intevt_regs.xml
<module id="ADC_SAFECHECK_INTEVT_REGS" HW_revision="" description="ADC SAFECHECK INTEVT Registers">
	<register id="OOTFLG" width="32" page="1" offset="0x0" internal="0" description="Checker Out-of-Tolerance Flag Register">
		<bitfield id="OOT1" description="Checker 1 Out-of-Tolerance Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="OOT2" description="Checker 2 Out-of-Tolerance Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="OOT3" description="Checker 3 Out-of-Tolerance Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="OOT4" description="Checker 4 Out-of-Tolerance Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="OOT5" description="Checker 5 Out-of-Tolerance Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="OOT6" description="Checker 6 Out-of-Tolerance Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="OOT7" description="Checker 7 Out-of-Tolerance Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="OOT8" description="Checker 8 Out-of-Tolerance Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="OOT9" description="Checker 9 Out-of-Tolerance Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="OOT10" description="Checker 10 Out-of-Tolerance Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="OOT11" description="Checker 11 Out-of-Tolerance Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="OOT12" description="Checker 12 Out-of-Tolerance Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="OOT13" description="Checker 13 Out-of-Tolerance Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="OOT14" description="Checker 14 Out-of-Tolerance Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="OOT15" description="Checker 15 Out-of-Tolerance Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="OOT16" description="Checker 16 Out-of-Tolerance Flag" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="OOTFLGCLR" width="32" page="1" offset="0x2" internal="0" description="Checker Out-of-Tolerance Flag Clear Register">
		<bitfield id="OOT1" description="Checker 1 OOT Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OOT2" description="Checker 2 OOT Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OOT3" description="Checker 3 OOT Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OOT4" description="Checker 4 OOT Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OOT5" description="Checker 5 OOT Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OOT6" description="Checker 6 OOT Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OOT7" description="Checker 7 OOT Flag Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OOT8" description="Checker 8 OOT Flag Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="OOT9" description="Checker 9 OOT Flag Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="OOT10" description="Checker 10 OOT Flag Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="OOT11" description="Checker 11 OOT Flag Clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="OOT12" description="Checker 12 OOT Flag Clear" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OOT13" description="Checker 13 OOT Flag Clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="OOT14" description="Checker 14 OOT Flag Clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="OOT15" description="Checker 15 OOT Flag Clear" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="OOT16" description="Checker 16 OOT Flag Clear" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="RES1OVF" width="32" page="1" offset="0x4" internal="0" description="Checker Overflow Result 1 Flag Register">
		<bitfield id="RES1OVF1" description="Checker 1 Result 1 Overflow Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF2" description="Checker 2 Result 1 Overflow Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF3" description="Checker 3 Result 1 Overflow Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF4" description="Checker 4 Result 1 Overflow Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF5" description="Checker 5 Result 5 Overflow Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF6" description="Checker 6 Result 1 Overflow Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF7" description="Checker 7 Result 1 Overflow Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF8" description="Checker 8 Result 1 Overflow Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF9" description="Checker 9 Result 1 Overflow Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF10" description="Checker 10 Result 1 Overflow Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF11" description="Checker 11 Result 1 Overflow Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF12" description="Checker 12 Result 1 Overflow Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF13" description="Checker 13 Result 5 Overflow Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF14" description="Checker 14 Result 1 Overflow Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF15" description="Checker 15 Result 1 Overflow Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="RES1OVF16" description="Checker 16 Result 1 Overflow Flag" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="RES1OVFCLR" width="32" page="1" offset="0x6" internal="0" description="Checker Overflow Result 1 Flag Clear Register">
		<bitfield id="RES1OVF1" description="Checker 1 Result 1  OVF Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF2" description="Checker 2 Result 1 OVF Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF3" description="Checker 3 Result 1 OVF Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF4" description="Checker 4 Result 1 OVF Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF5" description="Checker 5 Result 1  OVF Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF6" description="Checker 6 Result 1 OVF Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF7" description="Checker 7 Result 1 OVF Flag Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF8" description="Checker 8 Result 1 OVF Flag Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF9" description="Checker 9 Result 1  OVF Flag Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF10" description="Checker 10 Result 1 OVF Flag Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF11" description="Checker 11 Result 1 OVF Flag Clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF12" description="Checker 12 Result 1 OVF Flag Clear" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF13" description="Checker 13 Result 1  OVF Flag Clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF14" description="Checker 14 Result 1 OVF Flag Clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF15" description="Checker 15 Result 1 OVF Flag Clear" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF16" description="Checker 16 Result 1 OVF Flag Clear" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="RES2OVF" width="32" page="1" offset="0x8" internal="0" description="Checker Overflow Result 2 Flag Register">
		<bitfield id="RES2OVF1" description="Checker 1 Result 2 Overflow Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF2" description="Checker 2 Result 2 Overflow Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF3" description="Checker 3 Result 2 Overflow Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF4" description="Checker 4 Result 2 Overflow Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF5" description="Checker 5 Result 2 Overflow Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF6" description="Checker 6 Result 2 Overflow Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF7" description="Checker 7 Result 2 Overflow Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF8" description="Checker 8 Result 2 Overflow Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF9" description="Checker 9 Result 2 Overflow Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF10" description="Checker 10 Result 2 Overflow Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF11" description="Checker 11 Result 2 Overflow Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF12" description="Checker 12 Result 2 Overflow Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF13" description="Checker 13 Result 2 Overflow Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF14" description="Checker 14 Result 2 Overflow Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF15" description="Checker 15 Result 2 Overflow Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="RES2OVF16" description="Checker 16 Result 2 Overflow Flag" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
