IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_adc_safecheck_intevt_regs.xml
	<register id="RES2OVFCLR" width="32" page="1" offset="0xa" internal="0" description="Checker Overflow Result 2 Flag Clear Register">
		<bitfield id="RES2OVF1" description="Checker 1 Result 2  OVF Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF2" description="Checker 2 Result 2 OVF Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF3" description="Checker 3 Result 2 OVF Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF4" description="Checker 4 Result 2 OVF Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF5" description="Checker 5 Result 2  OVF Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF6" description="Checker 6 Result 2 OVF Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF7" description="Checker 7 Result 2 OVF Flag Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF8" description="Checker 8 Result 2 OVF Flag Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF9" description="Checker 9 Result 2  OVF Flag Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF10" description="Checker 10 Result 2 OVF Flag Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF11" description="Checker 11 Result 2 OVF Flag Clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF12" description="Checker 12 Result 2 OVF Flag Clear" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF13" description="Checker 13 Result 2  OVF Flag Clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF14" description="Checker 14 Result 2 OVF Flag Clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF15" description="Checker 15 Result 2 OVF Flag Clear" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF16" description="Checker 16 Result 2 OVF Flag Clear" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CHECKINTFLG" width="16" page="1" offset="0xc" internal="0" description="Checker Interrupt Flag Register">
		<bitfield id="CHECKINT" description="ADC Safety Checker Subsystem Interrupt Flag" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="CHECKINTFLGCLR" width="16" page="1" offset="0xe" internal="0" description="Checker Interrupt Flag Clear Register">
		<bitfield id="CHECKINTCLR" description="ADC Safety Checker Subsystem Interrupt Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CHECKINTSEL1" width="32" page="1" offset="0x10" internal="0" description="Checker Interrupt Source Select Register 1">
		<bitfield id="RES1OVF1EN" description="Overflow Enable from Checker 1 Result 1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF2EN" description="Overflow Enable from Checker 2 Result 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF3EN" description="Overflow Enable from Checker 3 Result 1" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF4EN" description="Overflow Enable from Checker 4 Result 1" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF5EN" description="Overflow Enable from Checker 5 Result 1" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF6EN" description="Overflow Enable from Checker 6 Result 1" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF7EN" description="Overflow Enable from Checker 7 Result 1" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF8EN" description="Overflow Enable from Checker 8 Result 1" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF9EN" description="Overflow Enable from Checker 9 Result 1" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF10EN" description="Overflow Enable from Checker 10 Result 1" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF11EN" description="Overflow Enable from Checker 11 Result 1" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF12EN" description="Overflow Enable from Checker 12 Result 1" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF13EN" description="Overflow Enable from Checker 13 Result 1" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF14EN" description="Overflow Enable from Checker 14 Result 1" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF15EN" description="Overflow Enable from Checker 15 Result 1" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RES1OVF16EN" description="Overflow Enable from Checker 16 Result 1" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CHECKINTSEL2" width="32" page="1" offset="0x12" internal="0" description="Checker Interrupt Source Select Register 2">
		<bitfield id="RES2OVF1EN" description="Overflow Enable from Checker 1 Result 2" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF2EN" description="Overflow Enable from Checker 2 Result 2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF3EN" description="Overflow Enable from Checker 3 Result 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF4EN" description="Overflow Enable from Checker 4 Result 2" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF5EN" description="Overflow Enable from Checker 5 Result 2" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF6EN" description="Overflow Enable from Checker 6 Result 2" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF7EN" description="Overflow Enable from Checker 7 Result 2" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF8EN" description="Overflow Enable from Checker 8 Result 2" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF9EN" description="Overflow Enable from Checker 9 Result 2" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF10EN" description="Overflow Enable from Checker 10 Result 2" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF11EN" description="Overflow Enable from Checker 11 Result 2" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF12EN" description="Overflow Enable from Checker 12 Result 2" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF13EN" description="Overflow Enable from Checker 13 Result 2" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF14EN" description="Overflow Enable from Checker 14 Result 2" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF15EN" description="Overflow Enable from Checker 15 Result 2" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RES2OVF16EN" description="Overflow Enable from Checker 16 Result 2" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CHECKINTSEL3" width="32" page="1" offset="0x14" internal="0" description="Checker Interrupt Source Select Register 3">
		<bitfield id="OOT1EN" description="Out-of-Tolerance Enable from Checker 1 " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OOT2EN" description="Out-of-Tolerance Enable from Checker 2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OOT3EN" description="Out-of-Tolerance Enable from Checker 3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OOT4EN" description="Out-of-Tolerance Enable from Checker 4 " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OOT5EN" description="Out-of-Tolerance Enable from Checker 5 " begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OOT6EN" description="Out-of-Tolerance Enable from Checker 6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OOT7EN" description="Out-of-Tolerance Enable from Checker 7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OOT8EN" description="Out-of-Tolerance Enable from Checker 8 " begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="OOT9EN" description="Out-of-Tolerance Enable from Checker 9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="OOT10EN" description="Out-of-Tolerance Enable from Checker 10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="OOT11EN" description="Out-of-Tolerance Enable from Checker 11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="OOT12EN" description="Out-of-Tolerance Enable from Checker 12 " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OOT13EN" description="Out-of-Tolerance Enable from Checker 13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="OOT14EN" description="Out-of-Tolerance Enable from Checker 14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="OOT15EN" description="Out-of-Tolerance Enable from Checker 15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="OOT16EN" description="Out-of-Tolerance Enable from Checker 16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
