IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_adc_safecheck_intevt_regs.xml
	<register id="CHECKEVT4SEL3" width="32" page="1" offset="0x34" internal="0" description="Checker X-Bar EVT4 Source Select Register 3">
		<bitfield id="OOT1EN" description="Out-of-Tolerance Enable from Checker 1 " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OOT2EN" description="Out-of-Tolerance Enable from Checker 2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OOT3EN" description="Out-of-Tolerance Enable from Checker 3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OOT4EN" description="Out-of-Tolerance Enable from Checker 4 " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OOT5EN" description="Out-of-Tolerance Enable from Checker 5 " begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OOT6EN" description="Out-of-Tolerance Enable from Checker 6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OOT7EN" description="Out-of-Tolerance Enable from Checker 7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OOT8EN" description="Out-of-Tolerance Enable from Checker 8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="OOT9EN" description="Out-of-Tolerance Enable from Checker 9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="OOT10EN" description="Out-of-Tolerance Enable from Checker 10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="OOT11EN" description="Out-of-Tolerance Enable from Checker 11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="OOT12EN" description="Out-of-Tolerance Enable from Checker 12 " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OOT13EN" description="Out-of-Tolerance Enable from Checker 13 " begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="OOT14EN" description="Out-of-Tolerance Enable from Checker 14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="OOT15EN" description="Out-of-Tolerance Enable from Checker 15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="OOT16EN" description="Out-of-Tolerance Enable from Checker 16 " begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
</module>
